eziya/PIC18F_Examples/7_Segment.X/main.c
/*
 * File:   main.c
 * Author: KIKI
 *
 * Created on 2019년 7월 28일 (일), 오전 12:27
 */

// PIC18F45K20 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1H
#pragma config FOSC = INTIO67   // Oscillator Selection bits (Internal oscillator block, port function on RA6 and RA7)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF       // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOREN = OFF      // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 18        // Brown Out Reset Voltage bits (VBOR set to 1.8 V nominal)

// CONFIG2H
#pragma config WDTEN = OFF      // Watchdog Timer Enable bit (WDT is controlled by SWDTEN bit of the WDTCON register)
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = PORTC   // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = ON      // PORTB A/D Enable bit (PORTB<4:0> pins are configured as analog input channels on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config HFOFST = ON      // HFINTOSC Fast Start-up (HFINTOSC starts clocking the CPU without waiting for the oscillator to stablize.)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF         // Single-Supply ICSP Enable bit (Single-Supply ICSP enabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection Block 0 (Block 0 (000800-001FFFh) not code-protected)
#pragma config CP1 = OFF        // Code Protection Block 1 (Block 1 (002000-003FFFh) not code-protected)
#pragma config CP2 = OFF        // Code Protection Block 2 (Block 2 (004000-005FFFh) not code-protected)
#pragma config CP3 = OFF        // Code Protection Block 3 (Block 3 (006000-007FFFh) not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection Block 0 (Block 0 (000800-001FFFh) not write-protected)
#pragma config WRT1 = OFF       // Write Protection Block 1 (Block 1 (002000-003FFFh) not write-protected)
#pragma config WRT2 = OFF       // Write Protection Block 2 (Block 2 (004000-005FFFh) not write-protected)
#pragma config WRT3 = OFF       // Write Protection Block 3 (Block 3 (006000-007FFFh) not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot Block (000000-0007FFh) not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection Block 0 (Block 0 (000800-001FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection Block 1 (Block 1 (002000-003FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection Block 2 (Block 2 (004000-005FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection Block 3 (Block 3 (006000-007FFFh) not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot Block (000000-0007FFh) not protected from table reads executed in other blocks)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#include <stdint.h>

#define _XTAL_FREQ  16000000

/* long loop num makes it counting slowly */
#define LOOP_NUM    10

/* From 0 to 9 */
const uint8_t SEG_NUMS[10] = {0xC0, 0xF9, 0xA4, 0xB0, 0x99, 0x92, 0x82, 0xF8, 0x80, 0x90};
/* P, L, A, Y */
const uint8_t SEG_CHARS[4] = {0x8C, 0xC7, 0x88, 0x91};

void main(void) 
{    
    /* 16MHz, Internal OSC */
    OSCCON = 0x72;
            
    /* Disable Analog Input */    
    ANSEL = 0x0;
    ANSELH = 0x0;
    
    /* RA0, RA1, RA2, RA3 Output */
    TRISA = 0xF0;
    
    /* RB0-7 Output */
    TRISB = 0x00;       
     
    /* Show 'PLAY' for 2 sec */
    for(int i = 0; i < 500; i++)
    {        
        LATB = SEG_CHARS[0];     
        LATA = (0x01 << 0);                
        __delay_ms(1);
        
        LATB = SEG_CHARS[1];     
        LATA = (0x01 << 1);                
        __delay_ms(1);
        
        LATB = SEG_CHARS[2];     
        LATA = (0x01 << 2);                
        __delay_ms(1);
        
        LATB = SEG_CHARS[3];     
        LATA = (0x01 << 3);                
        __delay_ms(1);        
    }
        
    while(1)
    {   
        /* Increase count from 0 to 9999 */
        for (int i = 0; i < 10000; i++) 
        {            
            for (int j = 0; j < LOOP_NUM; j++) 
            {
                int val = i;
                
                LATB = SEG_NUMS[val%10];     
                LATA = (0x01 << 3);                
                __delay_ms(1);
                val = val / 10;
                
                LATB = SEG_NUMS[val%10];     
                LATA = (0x01 << 2);                
                __delay_ms(1);
                val = val / 10;
                
                LATB = SEG_NUMS[val%10];     
                LATA = (0x01 << 1);                
                __delay_ms(1);
                val = val / 10;
                
                LATB = SEG_NUMS[val%10];     
                LATA = (0x01 << 0);                
                __delay_ms(1);
            }
        }
    }
    
    
    return;
}
